Store/src/AccumulationRegisters/ТоварыНаСкладе/ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Store/src/AccumulationRegisters/ТоварыНаСкладе/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает соответствие остатков товаров на складах для указанной номенклатуры.
//
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура - номенклатура для получения остатков
//   Склады - Массив из СправочникСсылка.Склады - список складов для проверки остатков
//
// Возвращаемое значение:
//   Соответствие:
//     * Ключ - СправочникСсылка.Склады - склад
//     * Значение - Число - количество товара на складе
Функция ОстатокПоНоменклатуре(Номенклатура, Склады) Экспорт

	ОстатокПоСкладам = Новый Соответствие;

	Для Каждого Склад Из Склады Цикл
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТоварыНаСкладе.Склад КАК Склад,
			|	ТоварыНаСкладе.Количество КАК Количество
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладе.Остатки(, 
			|		Номенклатура = &Номенклатура
			|		И Склад = &Склад) КАК ТоварыНаСкладе";
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОстатокПоСкладам.Вставить(Выборка.Склад, Выборка.Количество);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ОстатокПоСкладам;

КонецФункции

// Функция возвращает остатки всей номенклатуры на переданном складе
//
// Параметры:
//  Склад - Строка - склад, остатки на котором необходимо получить
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с колонками: Артикул, ЕдиницаИзмерения, КоличествоОстаток, СуммаОстаток
//
Функция ОстаткиНаСкладе(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Артикул КАК Артикул,
		|	ЕдиницыИзмерения.Наименование КАК ЕдиницаИзмерения,
		|	ТоварыНаСкладе.Количество КАК КоличествоОстаток,
		|	ТоварыНаСкладе.Сумма КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладе.Остатки(, 
		|		Склад = &Склад) КАК ТоварыНаСкладе
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ТоварыНаСкладе.Номенклатура = Номенклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|		ПО Номенклатура.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка";
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	
	Возврат ТаблицаЗначений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
